src/cf/Documents/СписаниеБонусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>СписаниеБонусов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Бонусы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выгружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/Бонусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>Бонусы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Documents/СписаниеБонусов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Бонусы.Записывать = Истина;     
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	БонусыОстатки.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	ВЫБОР
	|		КОГДА СписаниеБонусов.Бонусов <= ЕСТЬNULL(БонусыОстатки.СуммаОстаток, 0)
	|			ТОГДА СписаниеБонусов.Бонусов
	|		ИНАЧЕ ЕСТЬNULL(БонусыОстатки.СуммаОстаток, 0)
	|	КОНЕЦ КАК БонусовСписать
	|ИЗ
	|	Документ.СписаниеБонусов КАК СписаниеБонусов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Бонусы.Остатки(, ДисконтнаяКарта = &ДисконтнаяКарта) КАК БонусыОстатки
	|		ПО СписаниеБонусов.ДисконтнаяКарта = БонусыОстатки.ДисконтнаяКарта
	|ГДЕ
	|	СписаниеБонусов.Ссылка = &Ссылка"; 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДисконтнаяКарта", ДисконтнаяКарта);
	//ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	//Запрос.УстановитьПараметр("ТочкаИтогов", ГраницаКонтроля);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда    
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Движение = Движения.Бонусы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ДисконтнаяКарта = ДисконтнаяКарта;
		Движение.Сумма = Выборка.БонусовСписать; 
	КонецЕсли;
	
КонецПроцедуры
